config/config_long_test.yaml
# NFS Performance Long Test Configuration
# Designed to complete in approximately 60 minutes
# Comprehensive testing with larger file sizes and longer runtimes

# DD Test Configuration
dd_tests:
  enabled: true
  
  sequential_write_direct:
    enabled: true
    block_size: "1M"
    count: 5000               # 5GB - sanity test (fixed size)
    flags:
      direct: true
      sync: false
  
  sequential_write_sync:
    enabled: true
    block_size: "1M"
    count: 5000               # 5GB - sanity test (fixed size)
    flags:
      direct: false
      sync: true
  
  sequential_read_direct:
    enabled: true
    block_size: "1M"
    count: 5000               # 5GB - sanity test (fixed size)
    flags:
      direct: true
  
  sequential_read_cached:
    enabled: true
    block_size: "1M"
    count: 5000               # 5GB - sanity test (fixed size)
    flags:
      direct: false

# IOzone Test Configuration (Long Test Profile)
iozone_tests:
  enabled: true
  
  baseline_throughput:
    enabled: true
    file_size: "8g"              # Increased from 4g
    record_size: "1m"
    test_types: [0, 1]
    direct_io: true
    include_close: true
  
  cache_behavior:
    enabled: true
    file_size: "4g"              # Increased from 2g
    record_size: "1m"
    test_types: [0, 1]           # 0=write to create file, 1=read for cache test
    direct_io: false
  
  random_io_4k:
    enabled: true
    file_size: "2g"              # Increased from 1g
    record_size: "4k"
    test_types: [0, 2, 4]        # 0=write to create file, 2=random read, 4=random write
    direct_io: true
  
  concurrency_16_threads:
    enabled: true
    file_size: "2g"              # Increased from 1g
    record_size: "1m"
    threads: 32                  # Increased from 16
    test_types: [0, 1]
    direct_io: true
    throughput_mode: true
  
  metadata_operations:
    enabled: true
    file_size: "128m"            # Increased from 64m
    record_size: "4k"
    threads: 64                  # Increased from 32
    test_types: [0, 1]
    direct_io: false
    throughput_mode: true
  
  scaling_test:
    enabled: true
    thread_counts: [4, 8, 16, 32, 64]  # Added 64 threads
    file_size: "1g"              # Increased from 512m
    record_size: "1m"
    test_types: [0, 1]
    direct_io: true
    throughput_mode: true
  
  mixed_workload:
    enabled: true
    file_size: "4g"              # Increased from 2g
    record_size: "128k"
    threads: 16                  # Increased from 8
    test_types: [0, 1, 2, 4]
    direct_io: true
    throughput_mode: true

# FIO Test Configuration
fio_tests:
  enabled: true
  
  common:
    output_format: "json"
    time_based: true
    group_reporting: true
  
  sequential_write:
    enabled: true
    rw: "write"
    bs: "1M"
    size: "8G"                # Increased from 4G
    numjobs: 1
    ioengine: "libaio"
    iodepth: 16
    direct: 1
    runtime: 120              # 2 minutes
  
  sequential_read:
    enabled: true
    rw: "read"
    bs: "1M"
    size: "8G"                # Increased from 4G
    numjobs: 4
    ioengine: "libaio"
    iodepth: 16
    direct: 1
    runtime: 120              # 2 minutes
  
  random_read_4k:
    enabled: true
    rw: "randread"
    bs: "4k"
    size: "4G"                # Increased from 2G
    numjobs: 4
    ioengine: "libaio"
    iodepth: 32
    direct: 1
    runtime: 300              # 5 minutes
    randrepeat: 0
  
  random_write_4k:
    enabled: true
    rw: "randwrite"
    bs: "4k"
    size: "4G"                # Increased from 2G
    numjobs: 4
    ioengine: "libaio"
    iodepth: 32
    direct: 1
    runtime: 300              # 5 minutes
    randrepeat: 0
  
  mixed_randrw_70_30:
    enabled: true
    rw: "randrw"
    rwmixread: 70
    bs: "8k"
    size: "4G"                # Increased from 2G
    numjobs: 8
    ioengine: "libaio"
    iodepth: 16
    direct: 1
    runtime: 300              # 5 minutes
    randrepeat: 0
  
  metadata_operations:
    enabled: true
    rw: "write"
    bs: "4k"
    filesize: "1M"
    nrfiles: 10000            # Increased from 5000
    numjobs: 8
    ioengine: "sync"
    create_on_open: 1
    runtime: 300              # 5 minutes
  
  latency_test:
    enabled: true
    rw: "randread"
    bs: "4k"
    size: "2G"                # Increased from 1G
    numjobs: 1
    ioengine: "libaio"
    iodepth: 1
    direct: 1
    runtime: 120              # 2 minutes
    lat_percentiles: 1

# Bonnie++ Test Configuration (Long Test Profile)
bonnie_tests:
  enabled: true
  
  comprehensive_test:
    enabled: true
    file_size: "16g"             # Increased from 8g
    ram_size: "8192"             # Tell bonnie++ to assume 8GB RAM
    num_files: "32:0:0:32"       # More files
    timeout: 5400                # 90 minutes
  
  fast_test:
    enabled: true
    file_size: "8g"              # Increased from 4g
    ram_size: "4096"             # Tell bonnie++ to assume 4GB RAM
    num_files: "16:0:0:16"
    fast_mode: true
    timeout: 3600                # 60 minutes
  
  file_operations:
    enabled: true
    file_size: "4g"              # Increased from 2g
    ram_size: "2048"             # Tell bonnie++ to assume 2GB RAM
    num_files: "64:0:0:64"       # More files for extensive metadata testing
    # processes: 8               # Disabled - causes issues with CSV output in some bonnie++ versions
# dbench Test Configuration (Long Test Profile)
# Estimated time: ~30-35 minutes
dbench_tests:
  enabled: true
  
  common:
    directory: "dbench_test"
    warmup: 15                    # Longer warmup
    machine_readable: true
    skip_cleanup: false
    fsync: false
    sync_dirs: false
  
  light_client_load:
    enabled: true
    num_clients: 2
    duration: 180                 # 3 minutes (increased)
    loadfile: "dbench_client.txt"
    target_rate: 0
  
  moderate_client_load:
    enabled: true
    num_clients: 12               # Increased from 8
    duration: 300                 # 5 minutes (increased)
    loadfile: "dbench_client.txt"
    target_rate: 0
  
  heavy_client_load:
    enabled: true
    num_clients: 24               # Increased from 16
    duration: 360                 # 6 minutes (increased)
    loadfile: "dbench_client.txt"
    target_rate: 0
  
  scalability_test:
    enabled: true
    client_counts: [1, 2, 4, 8, 16, 32, 64]  # Extended range
    duration_per_count: 150       # 2.5 minutes per count (increased)
    loadfile: "dbench_client.txt"
    target_rate: 0
  
  latency_test:
    enabled: true
    num_clients: 1
    duration: 180                 # 3 minutes (increased)
    loadfile: "dbench_client.txt"
    # Note: fsync and sync_dirs not supported by dbench 5.0
    target_rate: 0
  
  sustained_load:
    enabled: true
    num_clients: 16               # Increased from 12
    duration: 1200                # 20 minutes (increased)
    loadfile: "dbench_client.txt"
    target_rate: 0
    warmup: 60                    # 1 minute warmup
  
  rate_limited_test:
    enabled: true
    num_clients: 8
    duration: 300                 # 5 minutes (increased)
    loadfile: "dbench_client.txt"
    target_rate: 100              # 100 MB/s target (increased)
  
  metadata_intensive:
    enabled: true
    num_clients: 32               # Increased from 16
    duration: 300                 # 5 minutes (increased)
    loadfile: "dbench_client.txt"
    target_rate: 0

    timeout: 3600                # 60 minutes

# Test Execution Options
execution:
  stop_on_error: false
  cleanup_on_completion: true
  verbose: false

# Output Options
output:
  json_enabled: true
  log_enabled: true
  console_summary: true

# Performance Baselines (for reference)
baselines:
  network_10gbe:
    sequential_read_mbps: [900, 1150]
    sequential_write_mbps: [700, 1000]
    random_read_iops: [20000, 40000]
    random_write_iops: [15000, 30000]
    latency_avg_ms: [1, 2]

# Long Test Profile
# Estimated completion time: ~60 minutes
# Total DD data: 400GB (4 tests × 100GB each)
# Total FIO runtime: ~24 minutes (1440 seconds)
# Provides comprehensive performance analysis with statistical significance

# Made with Bob